---
title: CurtainGridSet
classe: Autodesk.Revit.DB.CurtainGridSet
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# CurtainGridSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `curtainGridSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `curtainGridSet.Size` | Int32 |
| `Void Clear()` | `curtainGridSet.Clear()` | Void |
| `Boolean Contains(CurtainGrid)` | `curtainGridSet.Contains(item)` | Boolean |
| `Int32 Erase(CurtainGrid)` | `curtainGridSet.Erase(item)` | Int32 |
| `CurtainGridSetIterator ForwardIterator()` | `curtainGridSet.ForwardIterator()` | CurtainGridSetIterator |
| `IEnumerator GetEnumerator()` | `curtainGridSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(CurtainGrid)` | `curtainGridSet.Insert(item)` | Boolean |
| `CurtainGridSetIterator ReverseIterator()` | `curtainGridSet.ReverseIterator()` | CurtainGridSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```